# -*- mode:org; org-confirm-babel-evaluate: nil -*-
#+TITLE: abquant
#+AUTHOR: Jimmy M. Gong
#+EMAIL: yssource@163.com
#+LANGUAGE: zh-Hans
#+OPTIONS: H:3 num:nil toc:nil \n:t ::t |:t ^:nil -:nil f:t *:t <:t html-postamble:nil html-preamble:t tex:t
#+URI: /blog/%y/%m/%d/
#+DATE: 2020-01-01
#+LAYOUT: post
#+TAGS: OFFICE(o) COMPUTER(c) HOME(h) PROJECT(p) READING(r)
#+CATEGORIES:
#+DESCRIPTON: A&B professional platform for quantitative finance. God is asking & bidding Me. ABQ. GABQ. GABM.
#+KEYWORDS: quant c++
#+STARTUP: overview
#+STARTUP: logdone

** abquant 数据获取
   - python 层获取数据源，支持 mongodb
     #+name: data-saving
     #+begin_src shell :exports code
       # 保存所有数据
       # 但是不包含除权数据，除权数据不是经常更新，请手动 "abquant stock xdxr"
       abquant save base

       # 股票除权除息
       abquant stock xdxr
       abquant stock xdxr --add '["000001", "300001", "600001"]'

       # 保存所有股票日线，日线指数
       abquant stock day
       abquant stock day --add '["000001", "300001", "600001"]'

       # 保存所有股票分钟线，分钟指数
       # Default 保存所有频率 (1min, 5min, 15min, 30min, 60min)
       abquant stock min
       abquant stock min --add '["000001", "300001", "600001"]'

       # 保存股票分钟线，分钟指数不同频率数据 (1min, 5min, 15min, 30min, 60min)
       # 1min 一分钟
       abquant stock min "1min"
       abquant stock min -f '["1min"]' --add '["000001", "300001", "600001"]'
       # 5min 五分钟
       abquant stock min -f '["5min"]'
       abquant stock min -f '["5min"]' --add '["000001", "300001", "600001"]'
       # ...
       # 1min 一分钟和 5min 五分钟
       abquant stock min -f '["1min", "5min"]'
       abquant stock min -f '["1min", "5min"]' --add '["000001", "300001", "600001"]'

       # 股票数据板块
       abquant stock block

       # 股票数据明细信息
       abquant stock info
       abquant stock info --add '["000001", "300001", "600001"]'

       # 股票财务数据
       abquant stock financial
       # ...
     #+end_src

     #+name: error-data-saving
     #+begin_src shell :results output :exports both
       # 查看保存数据后的错误信息
       bat ~/.config/abquant/log/error_codes.json
     #+end_src

     #+RESULTS: error-data-saving
     : {"Stock_index_day": ["395005"], "Stock_index_min": ["395041", "395005"], "Stock_stock_min": ["300822", "603949", "603353", "300819", "300821", "002976", "688051"], "Stock_xdxr": ["002976", "603949", "300822", "688051", "603353"]}

     #+name: error-data-saving
     #+begin_src shell :results output :exports both
       # 如果在保存数据后，发现数据错误，可以使用
       abquant stock day --add '["395005"]'
       abquant stock min --add '["395041", "395005", "300822", "603949", "603353", "300819", "300821", "002976", "688051"]'
       abquant stock xdxr --add '["002976", "603949", "300822", "688051", "603353"]'

       # 注意：这些数据错误可能是退市，已经不存在的数据。也有可能是网络原因，数据不完整，你需要具体分析。
       # 在下一次保存数据时，最好先
       echo "" 1> ~/.config/abquant/log/error_codes.json
     #+end_src
** binding 层
   #+name: binding-plot
   #+begin_src shell :exports both
     python ./bind11/test/test_plot.py
   #+end_src

   #+RESULTS: binding-plot
   #+begin_example
                         open  close   high    low        vol        amount    date_stamp
     code   date
     000001 2019-01-02   9.39   9.19   9.42   9.16   539386.0  4.986951e+08  1.546358e+09
            2019-01-03   9.18   9.28   9.33   9.15   415537.0  3.844577e+08  1.546445e+09
            2019-01-04   9.24   9.75   9.82   9.22  1481159.0  1.422150e+09  1.546531e+09
            2019-01-07   9.84   9.74   9.85   9.63   865687.0  8.411664e+08  1.546790e+09
            2019-01-08   9.73   9.66   9.74   9.62   402388.0  3.892478e+08  1.546877e+09
            2019-01-09   9.74   9.94  10.08   9.70  1233486.0  1.229465e+09  1.546963e+09
            2019-01-10   9.87  10.10  10.20   9.86  1071817.0  1.079711e+09  1.547050e+09
            2019-01-11  10.11  10.20  10.22  10.05   696364.0  7.080018e+08  1.547136e+09
            2019-01-14  10.22  10.11  10.25  10.07   500443.0  5.078629e+08  1.547395e+09
            2019-01-15  10.11  10.24  10.28  10.09   542160.0  5.530273e+08  1.547482e+09
   #+end_example
